CSI API ETABS v1
cPropFrame.SetConcretePipe Method
 Initializes a concrete pipe frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetConcretePipe(
	string Name,
	string MatProp,
	double Diameter,
	double Tw,
	int Color = -1,
	string Notes = "",
	string GUID = ""
)
Function SetConcretePipe (
	Name As String,
	MatProp As String,
	Diameter As Double,
	Tw As Double,
	Optional Color As Integer = -1,
	Optional Notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MatProp As String
Dim Diameter As Double
Dim Tw As Double
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetConcretePipe(Name,
	MatProp, Diameter, Tw, Color, Notes,
	GUID)
int SetConcretePipe(
	String^ Name,
	String^ MatProp,
	double Diameter,
	double Tw,
	int Color = -1,
	String^ Notes = L"",
	String^ GUID = L""
)
abstract SetConcretePipe :
        Name : string *
        MatProp : string *
        Diameter : float *
        Tw : float *
        ?Color : int *
        ?Notes : string *
        ?GUID : string
(* Defaults:
        let _Color = defaultArg Color -1
        let _Notes = defaultArg Notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
The name of an existing or new frame section property. If this is an existing property, that property is modified; otherwise, a new property is added.
MatProp
Type: System.String
The name of the material property for the section.
Diameter
Type: System.Double
The section diameter. [L]
Tw
Type: System.Double
The wall thickness. [L]
Color (Optional)
Type: System.Int32
The display color assigned to the section. If Color is specified as -1, the program will automatically assign a color.
Notes (Optional)
Type: System.String
The notes, if any, assigned to the section.
GUID (Optional)
Type: System.String
The GUID (global unique identifier), if any, assigned to the section. If this item is input as Default, then the program assigns a GUID to the section.
Return Value
Type: Int32
returns zero if the section property data is successfully initialized; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new frame section property
       ret = SapModel.PropFrame.SetConcretePipe("PIPE1", "4000Psi", 30, 7)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace